### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_iam_policy.additional_inline[0] will be created
+   resource "aws_iam_policy" "additional_inline" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "cataprato-core-lambda-inline"
+       name_prefix = (known after apply)
+       path        = "/tf-managed/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "dynamodb:UpdateItem",
+                           "dynamodb:Scan",
+                           "dynamodb:Query",
+                           "dynamodb:PutItem",
+                           "dynamodb:GetItem",
+                           "dynamodb:BatchWriteItem",
+                           "dynamodb:BatchGetItem",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:dynamodb:us-east-1:350131064538:table/Recipes",
+                           "arn:aws:dynamodb:us-east-1:350131064538:table/Ingredients",
                        ]
+                       Sid      = "dynamodb"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "Deployment" = "terraform"
        }
+       tags_all    = {
+           "Deployment" = "terraform"
        }
    }

  # module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_inline" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "cataprato-core-lambda"
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "1877528810107366369" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691887466348884200" -> "1692068089002567000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7341175541729081775" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691887470012259000" -> "1692068092594831000"
            # (1 unchanged element hidden)
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```
</details>